{
  "posts": [
    {
      "id": "1",
      "title": "a title",
      "views": 100
    },
    {
      "id": "2",
      "title": "another title",
      "views": 200
    }
  ],
  "comments": [
    {
      "id": "1",
      "text": "a comment about post 1",
      "postId": "1"
    },
    {
      "id": "2",
      "text": "another comment about post 1",
      "postId": "1"
    }
  ],
  "profile": {
    "name": "typicode"
  },
  "employee": [
    {
      "name": "John Doe",
      "age": 30,
      "gender": "Male",
      "jobTitle": "Software Engineer",
      "department": "Engineering",
      "contact": {
        "email": "john.doe@example.com",
        "phone": "123-456-7890",
        "address": {
          "street": "123 Main Street",
          "city": "Anytown",
          "state": "CA",
          "zipCode": "12345",
          "country": "USA"
        }
      },
      "hireDate": "2020-01-15",
      "salary": 80000,
      "skills": [
        "JavaScript",
        "React",
        "Node.js",
        "SQL"
      ],
      "education": {
        "degree": "Bachelor's in Computer Science",
        "institution": "University of Anytown",
        "graduationYear": 2018
      },
      "projects": [
        {
          "name": "Project A",
          "description": "Developed a web application using React and Node.js",
          "duration": "6 months"
        },
        {
          "name": "Project B",
          "description": "Implemented database optimizations for improved performance",
          "duration": "3 months"
        }
      ],
      "certifications": [
        "AWS Certified Solutions Architect - Associate",
        "Microsoft Certified: Azure Developer Associate"
      ],
      "id": "1354"
    }
  ],
  "notes": [
    {
      "id": "92b3",
      "txtTitle": "Can you tell me about yourself?",
      "txtDetail": "First of all thank you very much for inviting me here. you can call me noel. I would describe my self as hardworking employee and somebody that has already the skills and quality to match the job description. I believe i am high achiever and I always have receive a positive feedback from my seniors and my clients and If you hire me I will be the type of worker who will always go above and  beyond what is expected in my work I will always embrace change positively and ",
      "category": "letter"
    },
    {
      "id": "dbd6",
      "txtTitle": "Why do you want this job?",
      "txtDetail": "I want this job because im passionate about this type of work. I spent a lot of time at work and I want that time to spent doing something i love. I also do research about your company",
      "category": "letter"
    },
    {
      "id": "e3f1",
      "txtTitle": "What is your greatest strength?",
      "txtDetail": "My greatest strength includes my fast pace of work, high standard, creativity, flexibility and how i take ownership of challenges and problems. These strength i believe will enable me to add real value to your team.",
      "category": "letter"
    },
    {
      "id": "8bb1",
      "txtTitle": "What is your biggest weakness",
      "txtDetail": "My biggest weakness is im not good at delegating tasks. I like to do things myself but i understand this is not conducive to getting things done quickly. I am mindful of my weakness, and taking action to improve.",
      "category": "letter"
    },
    {
      "id": "f1b6",
      "txtTitle": "What is your greatest achivement?",
      "txtDetail": "My greatest achievement was in my last position when i helped my teammate to launch a new site for a new customer. We achieve this success by working together as a team, utilizing each other's strength",
      "category": "letter"
    },
    {
      "id": "a6ce",
      "txtTitle": "what motivates you?",
      "txtDetail": "i am motivated by being fit and healthy, doing a great job to my employer because this gives me satisfaction, continuous improvement and growth, and supporting my family. I can only support my family if I succeed at work and receive a good salary.",
      "category": "diary"
    },
    {
      "id": "6798",
      "txtTitle": "How would you deal with a conflict with a co-worker?",
      "txtDetail": "I would take responsibility of the conflict. I would access my words and actions to ensure that Im wasnt causing the conflict and then sit down with my coworker to establish their views before finding an amicable way forward that resolve this conflict quickly and it helps the team progress.",
      "category": "diary"
    },
    {
      "id": "9cb8",
      "txtTitle": "Do you have any questions?",
      "txtDetail": "Are there any opportunities for training and, eventually advancement in the position? Who would I be responsible to in this position?",
      "category": "diary"
    },
    {
      "id": "312d",
      "txtTitle": "Where do you see yourself in 5 years?",
      "txtDetail": "In 5 years, I plan to be still working for your company. I would either be in this role with extra responsibility, or have earned a promotion. In 5 years, I would be an expert in my area of specialization and be someone that helps train new team members when they join the company. ",
      "category": "diary"
    },
    {
      "id": "b2fd",
      "txtTitle": "What are you looking for in your next job?",
      "txtDetail": "I am looking for a positive workplace culture, an inclusive workplace environment where there is opportunity for everyone to put forward ideas, and ongoing training to help me develop professionally.",
      "category": "diary"
    },
    {
      "id": "3702",
      "txtTitle": "Why do you leave your previous employer?",
      "txtDetail": "My previous employer has been fantastic to work but I am now seeking a new role",
      "category": "magazine"
    },
    {
      "id": "d5d7",
      "txtTitle": "What do you do in your free time?",
      "txtDetail": "In my free time, I play team sports",
      "category": "magazine"
    },
    {
      "id": "9c74",
      "txtTitle": "why should we hire you?",
      "txtDetail": "You should hire me because my skills, qualities and experience match with the job description. You should hire me because I am high achiever, adopt a selfless approach to task completion, take ownership of challenges and always seek to improve.",
      "category": "letter"
    },
    {
      "id": "dd83",
      "txtTitle": "What would you do if you started work for this company and soon realized the job wasn't for you?",
      "txtDetail": "I dont believe this would happen because I studied the job description carefully, and research your company history. I am confident this job is perfect for what i am seeking from a position, and I plan a long-term career with your company.",
      "category": "letter"
    },
    {
      "id": "a163",
      "txtTitle": "How do you prioritize your work?",
      "txtDetail": " I prioritize my work by creating a list of daily tasks I am responsible for. ",
      "category": "letter"
    },
    {
      "id": "a537",
      "txtTitle": "How do you respond to stress and pressure?",
      "txtDetail": "I respond to stress and pressure by remaining calm and ensuring I focus on the task at hand. I prioritize my work against company objectives, block out distractions and set myself goals that are specific, measurable and timely. Stress is an emotion I have control over and I never allow it impact negatively on my work?",
      "category": "diary"
    },
    {
      "id": "5f97",
      "txtTitle": "Tell me about a time you made a mistake",
      "txtDetail": "I was given a task to complete when I started my last job, but in my hastiness to get it finished quickly and impress my supervisor, I failed to listen to the instructions. This was a foolish mistake. As soon I realized, I informed my supervisor, apologize, completed the task again, and put steps in place to ensure the same situation have never happen again.",
      "category": "magazine"
    },
    {
      "id": "ea2b",
      "txtTitle": "What kind of people do you find it most difficult to work with? Why? ",
      "txtDetail": "In my professional experience, I've found that the most challenging situations arise when working with individuals who have a very different communication style from my own. For instance, I sometimes find it challenging to collaborate with those who prefer not to share regular updates about their progress, as I value open communication and transparency. However, I view these challenges as opportunities to develop my adaptability and to find effective ways to bridge communication gaps. I believe there is always room to learn from each other and improve our teamwork, regardless of differing work styles.",
      "category": "newspaper"
    },
    {
      "id": "5fda",
      "txtTitle": "What do you like to do best and least? ",
      "txtDetail": "What I enjoy most in my professional life is the opportunity to tackle challenging problems and come up with creative solutions. I thrive in environments where I can collaborate with a team, share ideas, and continuously learn new skills. On the other hand, the aspect I find least enjoyable is when there is a lack of clear communication within a team, as it can hinder productivity and collaboration. However, I see this as an opportunity to work on improving communication channels and fostering a more collaborative team environment.",
      "category": "letter"
    },
    {
      "id": "1edb",
      "txtTitle": "What do you wish to gain from this company?",
      "txtDetail": "I am eager to join a company where I can contribute my skills and experiences while also embracing the opportunity to grow professionally. I see this as a place where I can develop and take on new challenges, all while contributing to the team and helping the company achieve its goals.",
      "category": "letter"
    }
  ]
}